month = input('Введите месяц: ').lower()
number = int(input('Введите число: '))

#Кошулин вариант <3
###########################################################
if (month == 'март' and number >= 21) or (month == 'апрель' and 1 <= number <= 20):
    print('Овен')
###########################################################
if (month == 'апрель' and number >= 21) or (month == 'май' and 1 <= number <= 21):
    print('Телец')
#############################################################
if ( month == 'май'and number >= 22) or (month == 'июнь' and 1 <= number <= 21):
    if number >= 22:
        print('Близнецы')

#Метод мужчины 
#############################################################
if month == 'июнь':
    if number >= 22:
        print('Рак')
elif month == 'июль':
    if 1 <= number <= 22:
        print('Рак')
#############################################################
if month == 'июль':
    if number >= 23:
        print('Лев')
elif month == 'август':
    if 1 <= number <= 21:
        print('Лев')
#############################################################
if month == 'август':
    if number >= 22:
        print('Дева')
elif month == 'сентябрь':
    if 1 <= number <= 23:
        print('Дева')
#############################################################
if month == 'сентябрь':
    if number >= 24:
        print('Весы')
elif month == 'октябрь':
    if 1 <= number <= 23:
        print('Весы')
#############################################################
if month == 'октябрь':
    if number >= 24:
        print('Скорпион')
elif month == 'ноябрь':
    if 1 <= number <= 22:
        print('Скорпион')
#############################################################
if month == 'ноябрь':
    if number >= 23:
        print('Стрелец')
elif month == 'декабрь':
    if 1 <= number <= 22:
        print('Стрелец')
#############################################################
if month == 'декабрь':
    if number >= 23:
        print('Козерог')
elif month == 'январь':
    if 1 <= number <= 20:
        print('Козерог')
#############################################################
if month == 'январь':
    if number >= 21:
        print('Водолей')
elif month == 'февраль':
    if 1 <= number <= 19:
        print('Водолей')
#############################################################
if month == 'февраль':
    if number >= 20:
        print('Рыбы')
elif month == 'март':
    if 1 <= number <= 20:
        print('Рыбы')
